Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: རབ་འབྱོར་འདི་ཡང་ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཕྱིར་མི་ལྡོག་པའི་མཚན་ཉིད་དུ་རིག་པར་བྱའོ།
en: They are indivisible,’ then, Subhūti, this, too, should be known as the irreversible defining characteristic of an irreversible bodhisattva. “

source: །རབ་འབྱོར་གཞན་ཡང་གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་རྨི་ལམ་འམ་སད་པའི་ཚེ། གྲོང་ཁྱེར་ཚིག་པར་གྱུར་ན་འདི་སྙམ་དུ་བདག་གིས་རྨི་ལམ་འམ་སད་པའི་ཚེ། རྣམ་པ་གང་དང་ཚུལ་གང་དང་། མཚན་མ་གང་དག་མཐོང་བའི་རྣམ་པ་དང་། ཚུལ་དང་མཚན་མ་དེ་དག་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཕྱིར་མི་ལྡོག་པར་རིག་པར་བྱ་བའི་རྣམ་པ་དེ་དག་དང་།
en: Moreover, Subhūti, when bodhisattva great beings are dreaming or awake, if a city is perceived to be on fire, and they think, ‘While I am dreaming or awake, if I do possess those aspects, marks, and signs with which irreversible bodhisattva great beings are known to be endowed, then by these truths {Ki.

source: ཚུལ་དེ་དག་དང་མཚན་མ་དེ་དག་གལ་ཏེ་བདག་ལ་ཡོད་ན། བདེན་པ་དེ་དག་དང་། བདེན་པའི་ཚིག་འདིས་གྲོང་ཁྱེར་མེས་ཐར་པ་འདི་ཞི་བར་གྱུར་ཅིག །
en: V: 3} and this declaration of truth may this fire that ravages the city be quelled!

source: བསིལ་བར་གྱུར་ཅིག །མེད་པར་གྱུར་ཅིག་སྙམ་དུ་སེམས་ལ།
en: May it cool down!

source: གལ་ཏེ་ཞི་བ་དང་།
en: May it be extinguished!’

source: བསིལ་བ་དང་། མེད་པར་གྱུར་ན་རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་ལུང་བསྟན་པར་རིག་པར་བྱའོ། །རབ་འབྱོར་གལ་ཏེ་ཡང་མེའི་ཕུང་པོ་བདེན་པའི་ཚིག་དེ་ལས་གལ་ཏེ་ཁྱིམ་ནས་ཁྱིམ་དུ་ཚིག་སྲང་ནས་སྲང་དུ་ཚིག་སྟེ། ཁྱིམ་ལ་ལ་ནི་ཚིག །ཁྱིམ་ལ་ལ་ནི་མ་ཚིག །སྲང་ལ་ལ་ནི་ཚིག །
en: and if [the fire] is then quelled, cools down, and is extinguished, one should know, Subhūti, that these bodhisattva great beings are prophesied to make progress to unsurpassed, complete enlightenment that is irreversible.

source: སྲང་ལ་ལ་ནི་མ་ཚིག་ན། །རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེས། སེམས་ཅན་འདི་དག་གི་ཁྱིམ་ལ་ལ་ནི་ཚིག །ཁྱིམ་ལ་ལ་ནི་མ་ཚིག་པ་ལས་ན། སེམས་ཅན་འདི་དག་གིས་ཆོས་སྤོང་བའི་ལས་བྱས་པས་དེ་དག་གི་ལས་ཚེ་འདི་ལ་རྣམ་པར་སྨིན་ཏེ་དེ་དག་ཆོས་ལ་སྐུར་བ་དེ་ཉིད་ཀྱིས་ལས་ཀྱི་ལྷག་མ་ཡང་རྣམ་པར་སྨིན་པར་འགྱུར་རོ་ཞེས་བྱ་བར་རིག་པར་བྱ་སྟེ།
en: On the other hand, Subhūti, if, consequent on that declaration of truth, the mass of fire continues to burn from house to house and continues to burn from street to street, burning some houses but not others and burning some streets, not others, then, Subhūti, these bodhisattva great beings, since the houses of some beings have burnt and those of others have not burnt, should know that the past actions of those beings who have accumulated the karma of rejecting the Dharma are being ripened in this lifetime, and it is their residue of past actions caused by their deprecation of the Dharma that is now ripening.

source: རབ་འབྱོར་འདི་ནི་ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་རྒྱུ་དང་རྐྱེན་ཏེ།
en: Subhūti, these, too, are the causes and conditions for the irreversibility of bodhisattva great beings.

source: རྒྱུ་དེ་དག་དང་། རྐྱེན་དེ་དག་གིས་ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོར་རིག་པར་བྱའོ།
en: Irreversible bodhisattva great beings should be known on account of these causes and conditions. “

source: །རབ་འབྱོར་གཞན་ཡང་རྣམ་པ་གང་དང་། ཚུལ་གང་དང་། མཚན་མ་གང་གིས་ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོར་རིག་པར་བྱ་བའི་རྣམ་པ་དེ་དག་དང་། ཚུལ་དེ་དག་དང་། མཚན་མ་དེ་དག་བསྟན་པར་བྱའོ།
en: Yet again, Subhūti, I will teach the aspects, marks, and signs through which irreversible bodhisattva great beings should be known.

source: །རབ་འབྱོར་གལ་ཏེ་བུད་མེད་དམ། སྐྱེས་པ་ལ་ལ་ཞིག་མི་མ་ཡིན་པས་བྱིན་གྱིས་བརླབས་ན། དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་འདི་སྙམ་དུ་གལ་ཏེ། བདག་སྔོན་གྱི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཀྱིས། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་ཏེ།
en: Subhūti, if some woman or man were possessed by a nonhuman spirit, bodhisattva great beings should think, ‘If I have been prophesied by the tathāgatas, arhats, completely awakened buddhas of the past to attain unsurpassed, complete enlightenment, my wishes are utterly pure, and I do desire to attain consummate buddhahood in unsurpassed, complete enlightenment, then I will attain consummate buddhahood in unsurpassed, complete enlightenment.

source: བདག་གིས་བསམ་པ་ཡོངས་སུ་དག་ཅིང་། བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འདོད་ལ། བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་ཞིང་།
en: The directing of my attention toward unsurpassed, complete enlightenment is utterly pure.

source: བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡིད་ལ་བྱེད་པ་ཡོངས་སུ་དག་སྟེ། བདག་ལ་ཉན་ཐོས་ཀྱི་སེམས་མེད། བདག་ལ་རང་སངས་རྒྱས་ཀྱི་སེམས་མེད་ལ།
en: I am without the mindset of the śrāvakas and I am without the mindset of the pratyekabuddhas.

source: ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་སེམས་མེད་པས། བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་ཞིང་།
en: Since I am without the mindset of the śrāvakas and the pratyekabuddhas, I will attain consummate buddhahood in unsurpassed, complete enlightenment.

source: བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་མི་འགྱུར་བ་མ་ཡིན་གྱི།
en: It is not the case that I shall not attain consummate buddhahood in unsurpassed, complete enlightenment.

source: བདག་གདོན་མི་ཟ་བར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་ཏེ།
en: Rather, I undoubtedly will attain consummate buddhahood in unsurpassed, complete enlightenment.

source: འཇིག་རྟེན་གྱི་ཁམས་གྲངས་མེད་ཚད་མེད་པ་དག་ན། སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཇི་སྙེད་ཅིག་བཞུགས་ཤིང་འཚོ་སྐྱོང་བ་དང་། ཆོས་སྟོན་པའི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དེ་དག་གིས་ནི་གང་ཅི་ཡང་མ་མཁྱེན་པ་འམ། མ་གཟིགས་པ་འམ། ཐུགས་སུ་མ་ཆུད་པ་འམ།
en: There is nothing at all that all the lord buddhas, as many as reside and are alive in countless, immeasurable world systems, and the tathāgatas, arhats, completely awakened buddhas who teach the Dharma, do not know, do not see, do not comprehend, do not actualize, or with respect to which they do not attain consummate buddhahood.

source: མངོན་དུ་མ་མཛད་པ་འམ། མངོན་པར་རྫོགས་པར་སངས་མ་རྒྱས་པ་གང་ཡང་མེད་དེ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གིས་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་ཞེས་བྱ་བར་བདག་གི་བསམ་པ་ཐུགས་སུ་ཆུད་ཅེ་ན།
en: These lord buddhas comprehend my wish to attain consummate buddhahood in unsurpassed, complete enlightenment.

source: བདེན་པ་དེ་དང་། བདེན་པའི་ཚིག་དེས་སྐྱེས་པ་འམ། བུད་མེད་འདི་མི་མ་ཡིན་པ་གང་གིས་བཟུང་བ་འམ། གཙེས་པར་གྱུར་པའི་མི་མ་ཡིན་པའི་དེ་གུད་དུ་འགྲོ་བར་གྱུར་ཅིག་ཅེས་བསམས་ཏེ་སྨྲས་ན།
en: If this is the case, then by this truth and by this declaration of truth may this nonhuman spirit who possesses or injures this man or woman depart!’ {

source: རབ་འབྱོར་གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་དེ་སྐད་དུ་བརྗོད་པས། མི་མ་ཡིན་པ་དེ་གུད་དུ་མ་སོང་ན། རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ནི་སྔོན་གྱི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཀྱིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་མ་བསྟན་པར་རིག་པར་བྱའོ།
en: Ki.V: 4} Subhūti, if that nonhuman spirit does not depart because a bodhisattva great being has spoken in that manner, then, Subhūti, one should know that this bodhisattva great being has not been prophesied by the tathāgatas, arhats, completely awakened buddhas of the past to attain unsurpassed, complete enlightenment. “

source: །རབ་འབྱོར་གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་དེ་སྐད་ཅེས་བརྗོད་པས། མི་མ་ཡིན་པ་དེ་གུད་དུ་སོང་ན། རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ནི་སྔོན་གྱི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཀྱིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་པར་རིག་པར་བྱ་སྟེ། རབ་འབྱོར་རྣམ་པ་དེ་དག་དང་།
en: Subhūti, if that nonhuman spirit does depart because a bodhisattva great being has spoken in that manner, then, Subhūti, one should know that this bodhisattva great being has been prophesied by the tathāgatas, arhats, completely awakened buddhas of the past to attain unsurpassed, complete enlightenment.

source: ཚུལ་དེ་དག་དང་། མཚན་མ་དེ་དག་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་ཕྱིར་མི་ལྡོག་པར་རིག་པར་བྱའོ།
en: Subhūti, bodhisattva great beings who possess those aspects, marks, and signs are known to be irreversible. “

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ལ་མ་སྤྱད་པ། ཐབས་མཁས་པ་དང་མི་ལྡན་པ། དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་དང་། ཡང་དག་པར་སྤོང་བ་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང་། དབང་པོ་དང་སྟོབས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་དང་། འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དང་།
en: Moreover, Subhūti, the evil Māra might approach owing to the truth blessing being performed by bodhisattva great beings who have not practiced the six perfections; who are without skill in means; who have not practiced the applications of mindfulness, the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, the noble eightfold path, the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the serial steps of meditative absorption, emptiness, signlessness, and wishlessness; and who have not entered upon the maturity of the bodhisattvas. “

source: སྟོང་པ་ཉིད་དང་མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་ལ་མ་སྤྱད་པ། བྱང་ཆུབ་སེམས་དཔའི་སྐྱོན་མེད་པར་མ་ཆུད་པའི་བདེན་པའི་བྱིན་གྱིས་བརླབས་ལ་བདུད་སྡིག་ཏོ་ཅན་ཉེ་བར་འོངས་ཏེ། རབ་འབྱོར་གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བདེན་པའི་བྱིན་གྱི་རླབས་བྱེད་ཅིང་བདེན་པ་དང་བདེན་པའི་ཚིག་གང་གིས་བདག་སྔོན་གྱི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཀྱིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་པའི་བདེན་པ་དང་། བདེན་པའི་ཚིག་དེས་མི་མ་ཡིན་པ་དེ་གུད་དུ་འགྲོ་བར་གྱུར་ཅིག་ཅེས་བརྗོད་པ་ལས།
en: Subhūti, in the case where such bodhisattva great beings have performed the truth blessing, saying, ‘By this truth and this declaration of truth through which I have been prophesied by the tathāgatas, arhats, completely awakened buddhas of the past to attain unsurpassed, complete enlightenment, may that nonhuman spirit depart!’

source: བདུད་སྡིག་ཏོ་ཅན་དེ་མི་མ་ཡིན་པར་གྱུར་པ་དེ་ཅི་ནས་ཀྱང་གུད་དུ་འགྲོ་བར་བྱ་བའི་ཕྱིར་ནན་ཏན་དུ་བྱེད་དེ།
en: the evil Māra will insist that that nonhuman spirit departs by whatever means.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་འདི་ལྟར་བདུད་སྡིག་ཏོ་ཅན་ནི་མི་མ་ཡིན་པ་དེ་བས་ཆེས་མཐུ་དང་ལྡན་ཞིང་།
en: If you ask why, it is because the evil Māra is more powerful and more resplendent than that nonhuman spirit.

source: ཆེས་གཟི་བརྗིད་དང་ལྡན་པས་དེའི་ཕྱིར་བདུད་སྡིག་ཏོ་ཅན་དེ་ཡི་བྱིན་གྱིས་རླབས་ཀྱིས་མི་མ་ཡིན་པ་དེ་གུད་དུ་སོང་བར་གྱུར་པ་ལ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་འདི་སྙམ་སྟེ།
en: It is through the blessing of the evil Māra that that nonhuman spirit will depart, and those bodhisattva great beings will think, ‘It was through my power that that nonhuman spirit departed!’

source: དེ་ལྟར་བདག་གི་མཐུས་མི་མ་ཡིན་པ་དེ་གུད་དུ་སོང་ངོ་སྙམ་ནས་བདུད་ཀྱི་མཐུས་མི་མ་ཡིན་པ་དེ་གུད་དུ་སོང་བར་ནི་མ་ཤེས་ཏེ།
en: They will not know that the nonhuman spirit actually departed through the power of Māra.

source: དེ་དེའི་རྒྱུས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གཞན་དག་ལ་བརྙས་པ་དང་། འཕྱ་བ་དང་། ཐིང་སླད་བྱེད་ཅིང་སྨོད་ལ་ཁྱད་དུ་གསོད་ཅིང་བདག་ནི་སྔོན་གྱི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དེ་དག་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་པ་ཡིན་གྱི། འདི་དག་གཞན་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་མ་བསྟན་ཏོ་ཞེས་ནས་དེ་དེ་ཙམ་གྱིས་ང་རྒྱལ་འཕེལ་བར་བྱེད་པ་དང་།
en: On that basis, they will deride, slander, scorn, deprecate, and look down upon other bodhisattva great beings, saying, ‘I have been prophesied by the tathāgatas, arhats, completely awakened buddhas of the past to attain unsurpassed, complete enlightenment, but these others have not been prophesied to attain unsurpassed, complete enlightenment.’

source: ང་རྒྱལ་སྐྱེད་ཅིང་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རིང་དུ་བྱེད།
en: Simply on that basis their pride will increase; as their pride grows they will be far removed from all-aspect omniscience.

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་རིང་དུ་བྱེད་ན།
en: If they are far removed from the wisdom of the unsurpassed, completely awakened buddhas, {Ki.

source: དེ་ལྟར་ཐབས་མི་མཁས་པའི་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་དེ་ཙམ་གྱིས་ལྷག་པའི་ང་རྒྱལ་སྐྱེད་པས་དེས་ས་གཉིས་པོར་འགྲོ་བར་རིག་པར་བྱ་སྟེ། འདི་ལྟར་ཉན་ཐོས་ཀྱི་ས་འམ། རང་སངས་རྒྱས་ཀྱི་སའོ།
en: V: 5} one should know that those unskilled bodhisattvas, simply on that basis, will develop overweening pride and they will proceed to the two levels, namely the level of the śrāvakas or the level of the pratyekabuddhas.

source: །དེ་ལྟར་བདེན་པའི་བྱིན་གྱི་རླབས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེའི་བདུད་ཀྱི་ལས་འབྱུང་སྟེ་དེ་ལ་དེ་དགེ་བའི་བཤེས་གཉེན་ལ་མི་སྙེན་མི་སྟེན་ཅིང་མི་འགྲོགས་ལ་བསྙེན་བཀུར་མི་བྱེད་ན་དེ་ཉིད་དུ་བདུད་ཀྱིས་བཅིངས་པ་དེ་དམ་པོར་བྱེད་པ་ཡིན་ནོ།
en: In that manner the deeds of Māra will confront those bodhisattva great beings through the blessing of truth. If they do not serve, attend upon, befriend, and respect spiritual mentors, in that state they will be fettered and bound by Māra.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ལ་མ་སྤྱད་པ་དང་། ཐབས་མཁས་པས་ཡོངས་སུ་མ་བཟུང་བའི་ཕྱིར་ཏེ།
en: If you ask why, it is because they have not practiced the six perfections and they have not been favored by skill in means.

source: རབ་འབྱོར་དེ་ལྟ་བུ་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་བདུད་ཀྱི་ལས་སུ་རིག་པར་བྱའོ།། །།ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ། བམ་པོ་ལྔ་བཅུ་བཞི་པ།
en: Subhūti, bodhisattva great beings should know this as the deed of Māra. “

source: རབ་འབྱོར་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ལ་མ་སྤྱད་པ། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་ལ་མ་སྤྱད་པ། རྣམ་པར་ཐར་པའི་སྒོ་གསུམ་ལ་མ་སྤྱད་པ། སྐྱོན་མེད་པར་མ་ཆུད་པའི་དྲུང་དུ་བདུད་སྡིག་ཏོ་ཅན་མིང་གི་བྱིན་གྱི་རླབས་ཀྱིས་ཉེ་བར་འོང་བ་ཡིན་ཞེ་ན། རབ་འབྱོར་འདི་ལ་བདུད་སྡིག་ཏོ་ཅན་ཆ་བྱད་གང་ཡང་རུང་བས་ཉེ་བར་འོངས་ཤིང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ལ་འདི་སྐད་དུ། རིགས་ཀྱི་བུ་ཁྱོད་ནི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་པ་སྟེ།
en: Subhūti, if you ask how the evil Māra approaches bodhisattva great beings who have not practiced the six perfections, who have not practiced the thirty-seven factors conducive to enlightenment, who have not practiced the three gateways to liberation, and who have not entered into the maturity [of the bodhisattvas] in connection with the consecration of their [prophesied] name, in this regard, Subhūti, the evil Māra will approach assuming whatever guise is appropriate and say to those bodhisattva great beings, ‘Noble child, the tathāgata, arhat, completely awakened Buddha prophesies that you will attain unsurpassed, complete enlightenment.

source: ཁྱོད་ཀྱི་མིང་ནི་འདི་ཞེས་བྱའོ།
en: This will be your name.

source: །ཁྱོད་ཀྱི་ཕའི་མིང་ནི་འདི་ཞེས་བྱའོ།
en: This will be your father’s name.

source: །ཁྱོད་ཀྱི་མའི་མིང་ནི་འདི་ཞེས་བྱའོ། །ཁྱོད་ཀྱི་ཕུ་ནུའི་མིང་ནི་འདི་ཞེས་བྱའོ།
en: This will be your mother’s name. This will be your brother’s name.

source: །ཁྱོད་ཀྱི་བུ་སྲིང་གི་མིང་ནི་འདི་ཞེས་བྱའོ།
en: This will be your sister’s name.

source: །ཁྱོད་ཀྱི་མཛའ་བོ་དང་།
en: This will be your friend’s name.

source: བློན་པོ་དང་། གཉེན་བཤེས་ཀྱི་མིང་ནི་འདིའོ་ཞེས་བྱ་བ་ནས།
en: This will be your minister’s name and your spiritual mentor’s name.’

source: ཕ་མའི་རབས་བདུན་ཉེ་བར་སྟོན་ཅིང་། ཁྱོད་ནི་ཡུལ་ཆེ་གེ་མོ་ཞིག་དང་། གྲོང་ཁྱེར་ཆེ་གེ་མོ་ཞིག་དང་། ཡུལ་ཆེ་གེ་མོ་ཞིག་དང་། ཕྱོགས་ཆེ་གེ་མོ་ཞིག་ནས།
en: He will then reveal [the names of] their parents through seven past generations, saying, ‘[You have come] from such and such a country, such and such a city, such and such a place, and such and such a district.

source: ཡུལ་ཆེ་གེ་མོ་ཞིག་ཏུ་སྐྱེས་སོ། །གྲོང་ཁྱེར་ཆེ་གེ་མོ་ཞིག་དང་། གྲོང་རྡལ་ཆེ་གེ་མོ་ཞིག་ཏུ་སྐྱེས་སོ།
en: You will be born in such and such a country, such and such a city, and such and such a town.’

source: །གལ་ཏེ་དེ་ངང་གིས་འཇམ་པ་ཞིག་ཡིན་ན། དེ་དེ་ལ་འདི་སྐད་དུ་ཁྱོད་ནི་སྔོན་ཡང་འདི་བཞིན་དུ་འཇམ་པར་གྱུར་ཏོ་ཞེས་ཟེར།
en: If they are gentle by nature, he will say to them, ‘In the past, too, you were similarly gentle.’

source: གལ་ཏེ་རྣོ་བ་ཞིག་ཡིན་ན། དེ་དེ་ལ་འདི་སྐད་དུ་ཁྱོད་ནི་སྔོན་ཡང་འདི་བཞིན་དུ་རྣོ་བར་གྱུར་ཏོ་ཞེས་ཟེར། གལ་ཏེ་དགོན་པ་པ་ཞིག་ཡིན་ན།
en: If they are sharp [by nature], he will say to them, ‘In the past, too, you were similarly sharp.’

source: དེ་དེ་ལ་འདི་སྐད་དུ་ཁྱོད་ནི་སྔོན་ཡང་དགོན་པ་པར་གྱུར་ཏོ་ཞེས་ཟེར། གལ་ཏེ་བསོད་སྙོམས་པ་ཞིག་ཡིན་ནམ། གལ་ཏེ་ཕྱག་དར་ཁྲོད་པ་ཞིག་ཡིན་ནམ། གལ་ཏེ་བསོད་སྙོམས་ཕྱིས་མི་ལེན་པ་ཞིག་ཡིན་ནམ། གལ་ཏེ་སྟན་གཅིག་པ་ཞིག་ཡིན་ནམ། གལ་ཏེ་ཅི་ཐོབ་པའི་བསོད་སྙོམས་པ་ཞིག་ཡིན་ནམ། གལ་ཏེ་དུར་ཁྲོད་པ་ཞིག་ཡིན་ནམ། གལ་ཏེ་བླ་གབ་མེད་པ་ཞིག་ཡིན་ནམ།
en: If they are forest dwellers, he will say to them, ‘In the past, too, you were similarly a forest dweller.’

source: གལ་ཏེ་ཤིང་དྲུང་པ་ཞིག་ཡིན་ནམ། གལ་ཏེ་ཙོག་པུ་པ་ཞིག་ཡིན་ནམ། གལ་ཏེ་གཞི་ཇི་བཞིན་པ་ཞིག་ཡིན་ནམ། གལ་ཏེ་ཆོས་གོས་གསུམ་པ་ཞིག་ཡིན་ནམ། གལ་ཏེ་འདོད་པ་ཆུང་བ་ཞིག་ཡིན་ནམ།
en: If they are mendicants who beg for alms, if they are refuse scavengers, if they eat their daily meal in a single sitting, if they subsist only on whatever alms they obtain, if they frequent charnel grounds, if they sit in exposed places, if they sit under trees, if they remain seated [even while asleep], if they stay wherever they happen to be, if they own only three robes, or if they have few desires, if they understand the Dharma, if they are solitary, if their feet are not dyed with henna, or if they are quietly spoken, then he will say to them, ‘In the past, too, you similarly were quietly spoken, and so on.’

source: གལ་ཏེ་ཆོག་ཤེས་པ་ཞིག་ཡིན་ནམ། གལ་ཏེ་དབེན་པ་ཞིག་ཡིན་ནམ། གལ་ཏེ་རྐང་པ་བསྐུ་བ་དང་བྲལ་བ་ཞིག་ཡིན་ནམ། གལ་ཏེ་སྨྲ་བ་ཉུང་བ་ཞིག་ཡིན་ན། དེ་དེ་ལ་འདི་སྐད་དུ་ཁྱོད་ནི་སྔོན་ཡང་སྨྲ་བ་ཉུང་བར་གྱུར་ཏོ་ཞེས་ཟེར།
en: If they are nonbelligerent, he will say to them, ‘In the past, too, you were similarly nonbelligerent.’ {

source: གལ་ཏེ་འཐབ་པ་ཉུང་བ་ཞིག་ཡིན་ན།
en: Ki.

source: དེ་དེ་ལ་འདི་སྐད་དུ་ཁྱོད་ནི་སྔོན་ཡང་འཐབ་པ་ཉུང་བར་གྱུར་ཏོ་ཞེས་ཟེར་ཏེ། དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་འདི་ལྟར་ཁྱོད་ལ་རྣམ་པ་འདི་ལྟ་བུའི་སྦྱངས་པའི་ཡོན་ཏན་དག་ཡོད་པ་ལས་ན། གདོན་མི་ཟ་བར་སྔོན་ཡང་སྦྱངས་པའི་ཡོན་ཏན་དང་།
en: V: 6} If they ask why, he will say, ‘It is because if you presently maintain such ascetic virtues, you will undoubtedly in the past also have maintained the ascetic virtues and these vows.

source: སྡོམ་པ་འདི་དག་དང་ལྡན་པར་མ་གྱུར་མི་སྲིད་དོ་ཞེས་ཟེར་བ་ལ།
en: It is impossible for you not to have done so!’ “

source: དེ་དེ་ལྟར་སྔོན་གྱི་མིང་དང་རུས་བསྟན་པ་དང་། ད་ལྟར་བྱུང་བའི་སྦྱངས་པའི་ཡོན་ཏན་དང་། སྡོམ་པ་བསྟན་པས། རློམ་སེམས་སྐྱེད་པས་དེ་ལྟར་བདུད་སྡིག་ཏོ་ཅན་དེའི་དྲུང་དུ་ཉེ་བར་འོངས་ཤིང་། འདི་སྐད་དུ་རིགས་ཀྱི་བུ་ཁྱོད་ནི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས་ཁྱོད་ལ་ཡོན་ཏན་ཡོད་པ་ཅི་འདྲ་བ་བཞིན་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་ལུང་བསྟན་ཏོ་ཞེས་ཟེར་ཞིང་། ཡང་ན་དགེ་སློང་གི་ཆ་བྱད་དུ་ཉེ་བར་འོང་།
en: Through such declarations of their former names and clans, and through the declaration of the ascetic virtues and vows that they now maintain, they will give rise to [certain] conceits on the basis of which the evil Māra will approach them, saying, ‘Noble child, inasmuch as you are [now] maintaining these [ascetic] virtues, you have been prophesied by the tathāgata, arhat, completely awakened Buddha to make irreversible progress toward unsurpassed, complete enlightenment.’

source: ཡང་ན་དགེ་སློང་མའི་ཆ་བྱད་དུ་ཉེ་བར་འོང་། ཡང་ན་ཁྱིམ་བདག་གི་ཆ་བྱད་དུ་ཉེ་བར་འོང་། ཡང་ན་མའི་ཆ་བྱད་དུ་ཉེ་བར་འོང་། ཡང་ན་ཕའི་ཆ་བྱད་དུ་ཉེ་བར་འོང་ཞིང་། འདི་སྐད་དུ་རིགས་ཀྱི་བུ་ཁྱོད་ནི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་ཏོ།
en: Alternatively, he will approach in the guise of a monk, or he will approach in the guise of a nun, or he will approach in the guise of a householder, or he will approach in the guise of a mother, or he will approach in the guise of a father, and he will say, ‘Noble child, you have been prophesied by the tathāgata, arhat, completely awakened Buddha to attain unsurpassed, complete enlightenment.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་འདི་ལྟར་ཁྱོད་ལ་ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ཡོན་ཏན་གང་ཇི་སྙེད་པ་དེ་དག་ཡོད་དོ་ཞེས་ཟེར་ལ། རབ་འབྱོར་ངས་ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་རྣམ་པ་དང་། ཚུལ་དང་།
en: If you ask why, it is because you maintain all those ascetic virtues that are associated with irreversible bodhisattva great beings.’ “

source: མཚན་མ་གང་བཤད་པ་དེ་དག་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ལ་མེད་ན། རབ་འབྱོར་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་གཞན་གྱིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འདི་ནི་བདུད་ཀྱི་བྱིན་གྱིས་བརླབས་པ་ཡིན་ནོ་ཞེས་བྱ་བར་རིག་པར་བྱའོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་དེ་ནི་འདི་ལྟར་གང་ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་རྣམ་པ་དང་། ཚུལ་དང་།
en: Subhūti, since those bodhisattva great beings are without the aspects, marks, and signs of an irreversible bodhisattva great being that I have explained, other bodhisattva great beings should know, Subhūti, that these bodhisattva great beings are ‘blessed’ by Māra.

source: མཚན་མ་དེ་དག་ཀྱང་མེད་ལ་མིང་བསྟན་པ་དེས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གཞན་ལ་བརྙས་པ་དང་། འཕྱ་བ་དང་། སྨོད་པ་བྱེད་ཅིང་ཁྱད་དུ་གསོད་ལ་སྨོད་ན། རབ་འབྱོར་འདི་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་མིང་གི་བྱིན་གྱི་རླབས་ཀྱིས་བདུད་ཀྱི་ལས་སུ་རིག་པར་བྱའོ།
en: If you ask why, Subhūti, it is because if those who are indeed without the aspects, marks, and signs of an irreversible bodhisattva great being then deride, slander, scorn, look down upon, and deprecate other bodhisattva great beings, in that case, Subhūti, one should know that this is a deed of Māra associated with bodhisattva great beings who have received the name consecration. “

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་མིང་གི་བྱིན་གྱི་རླབས་ཀྱིས་བདུད་ཀྱི་ལས་སུ་རིག་པར་བྱ་སྟེ།
en: Subhūti, one should know that there are also other deeds of Māra associated with bodhisattva great beings who have received the name consecration.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་དེ་ནི་འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ལ་མ་སྤྱད་པས། ཕུང་པོའི་བདུད་མི་ཤེས་ཏེ། གཟུགས་མི་ཤེས་ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་མི་ཤེས་པས། དེ་ལ་བདུད་སྡིག་ཏོ་ཅན་མིང་གི་བྱིན་གྱི་རླབས་ཀྱིས་ལུང་སྟོན་ཅིང་།
en: If you ask why, Subhūti, it is because in the case of bodhisattva great beings who have not practiced the six perfections, and who therefore do not understand the demonic force of the psycho-physical aggregates—that is to say, who do not understand physical forms, and who do not understand feelings, perceptions, formative predispositions, and consciousness—the evil Māra will prophesy them through the name consecration, saying, ‘When you have attained consummate buddhahood in unsurpassed, complete enlightenment, this will be your name!’

source: ཁྱོད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་མིང་འདི་ཞེས་བྱ་བར་འགྱུར་རོ་ཞེས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་མིང་གང་བསམས་པ་དང་། དཔྱད་པ་དེ་ཉིད་རྗོད་དེ།
en: And in doing so he will declare the very name that that bodhisattva great being had already pondered and reflected upon.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་ཤེས་རབ་འཆལ་པའི་ངང་ཚུལ་ཅན་ཐབས་ལ་མི་མཁས་པ་དེ་འདི་སྙམ་སྟེ། བདག་གིས་མིང་གང་ཡིན་གྱིས་རྣམ་པར་བརྟགས་ཏེ། བསམས་པ་དང་།
en: Thereupon, bodhisattva great beings who are stupid and without skill in means will think, ‘This very name that I have considered, pondered, and reflected upon in my own mind {Ki.

source: རྗེས་སུ་དཔྱད་པ་དེ་ཉིད་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པའི་མིང་དུ་འགྱུར་རོ་སྙམ་སྟེ། ཇི་ལྟ་ཇི་ལྟར་བདུད་སྡིག་ཏོ་ཅན་ནམ།
en: V: 7} will be my name when I attain consummate buddhahood in unsurpassed, complete enlightenment!’
